#define _CRT_SECURE_NO_WARNINGS


#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <time.h>


//int main()
//{
//	char ch1[87][10];
//	int i = 0, j = 0;
//	FILE* pf1 = fopen("V1.txt", "r");
//	if (pf1 == NULL)
//	{
//		perror("fopen  pf1");
//		return 0;
//	}
//	
//	fscanf(pf1,"%s",ch1[0]);
//	puts(ch1[0]);
//	fclose(pf1);
//	pf1 = NULL;
//	return 0;
//	
//}


//int main()
//{
//	char arr[100];
//	FILE* pf = fopen("test.txt", "r");
//	if (pf == NULL)
//	{
//		perror("fopen");
//		return 0;
//	}
//	//fscanf(pf, "%s", arr);
//	int i = 0, j = 0;
//	for (i = 0; i < 100; i++)
//	{
//		char ch = fgetc(pf);
//		if (ch == EOF)
//			break;
//		arr[i]=ch;
//
//	}
//	for (j = 0; j < i; j++)
//	{
//		printf("%c", arr[j]);
//	}
//	fclose(pf);
//	pf = NULL;
//	return 0;
//}


//typedef struct S
//{
//	char arr[100];
//}S;
//
//int main()
//{
//	FILE* pf = fopen("test.txt", "r");
//	if (pf == NULL)
//	{
//		perror("fopen");
//		return 0;
//	}
//	int i = 0, j = 0, k = 0;
//	S s;
//	char tmp[100];
//	while (1)
//	{
//		k = fread(&(s.arr), sizeof(S), 1, pf);
//		if (k < 1)
//			break;
//		strcpy(tmp, s.arr);
//	}
//	//puts(s->arr);
//	fclose(pf);
//	pf = NULL;
//	return 0;
//}


#define NUM 150
#define LONG 30

void menu()
{
	printf("************************************************************************\n");
	printf("********      1. 記憶　　　　2.全ての語彙とその意味を表示      *********\n");
	printf("********               0. exit                                 *********\n");
	printf("************************************************************************\n");
}

void show(char v[][LONG], char ans[][LONG])
{
	int i = 0;
	printf("\t%-30s%-30s\t\t%-30s%-30s\n\n", "词", "释义", "词", "释义");
	for (i = 0; i < NUM-1; i++)
	{
		printf("\t%-30s%-30s\t\t%-30s%-30s\n", v[i], ans[i], v[i + 1], ans[i + 1]);
	}
}

void memory(char v[][LONG], char ans[][LONG])
{
	int i = 0, k = 1;
	char input[LONG] = { 0 };
	while (k)
	{
		i = rand() % LONG;
		printf("%s\n", v[i]);
		printf("请输入该词的意思:>");
		gets(input);
		//	getchar();
		if (strcmp(ans[i], input) == 0)
		{
		again:
			printf("正确，是否继续进行(1/0) :>");
			scanf("%d", &k);
			getchar();
			if (k > 1 || k < 0)
			{
				printf("非法，再次输入\n");
				goto again;
			}
		}
		else
		{
			printf("错误，正确答案为 :> %s\n", ans[i]);
		}

	}
}

int main()
{
	srand((unsigned int)time(NULL));
	char V[NUM][LONG] = {"会う","開く","遊ぶ","洗う","ある","言う","行く","急が","歌う","売る",
						"選ぶ","お置","送る","落とす","思う","泳ぐ","下ろす","終わる","買う","返す","帰る",
						"かかる","書く","かく","貸す","渇く","聞く","決まる","切る","消す","こむ",
						"転ぶ","探す","咲く","触る","死ぬ","知る","吸う","すく","滑る","住む",
						"座る","出す","立つ","違う","使う","作る","手伝う","通る","届く","飛ぶ",
						"撮る","とる","直す","治る","なくす","習う","なる","似合う","脱ぐ","登る",
						"飲む","乗り","入ります","運ぶ","始まる","働く","話す","払う","弾く",
						"太る","降る","曲がる","待つ","迷う","申す","持つ","もらう","休む","やる",
						"呼ぶ","読む","分かる","渡す","渡る","笑う",
				"浴びる","いる","起きる","降りる","借りる","着る","過ぎる","できる","開ける","あげる",
				"集める","慌てる","生まれる","遅れる","教える","かける","片付ける","考える","決める","閉める",
				"知らせる","調べる","捨てる","確かめる","食べる","疲れる","つける","伝える","出かける","出る",
				"止める","寝る","始める","見せる","見る","やめる","忘れる",
	"来ます","する","安心する","運動する","外出する","買い物する","感謝する","帰国する","結婚する","研究する",
	"ごちそうする","コピーする","残業する","散歩する","食事する","心配する","整理する","選択する","掃除する","卒業する",
	"寝坊する","勉強する","報告する","予約する","練習する","連絡する" };
	char answer[NUM][LONG] = { "见","开，开张","玩","洗，洗涤","有，在","说","去","急，匆忙","唱","卖",
							 "选择","放置","寄","掉，式落下","想，思考","游泳","取，卸货","结束","买","归还","回，回来",
							 "花费(时间，金钱)","写","画","借出，借给","渴","听","决定(自动)","剪，切，割","关灯，消除(他动)","拥挤",
							 "摔倒","找，寻找","花开","触，碰","死，死亡","知道","吸烟","喜欢","滑落，滑下","住，居住",
							 "坐","寄信","站,立","不对，不同","使用","制作","帮忙","通过,经过","传达，送到，收到","飞",
							 "拍照，摄影","取，取得","改，改正，修正","痊愈，医好","丢失，丢","学习","变成，当，成为","适合，相称","脱","登山",
							 "喝","乘坐","进入,加入","搬运","开始","工作","说话，说","支付","弹",
							 "长胖","下/降雨雪","拐弯，曲折","等，等待","犹豫，难以决定","说，告诉","有，拥有，持有","得到","休息","做，干",
							 "呼喊","读","知道，明白","交给","过(桥，河)，穿(马路)","笑",
				"淋，浇","有，在","起床","下(车，山)","(向别人)借","穿","过","能，可以","开，打开，开启","给",
				"收集,集合","慌张，着急","出生，诞生","迟到","教","打(电话)","收拾，整理","思考，考虑","决定(他动)","关闭，合上，打烊",
				"告诉","调查","扔，扔掉","查看，弄清","吃","累，辛苦","开灯","说，传达，转告","外出，出门","出",
				"停，制止","睡觉","开始(他动)","给看，出示","看","停止，放弃","忘记",
	"来","做","安心","运动","外出，出去","买东西","感谢","回国","结婚","研究",
	"请客，摆盛宴","复印，抄写","加班","散步","吃饭","担心","整理","选择，挑选","打扫","毕业",
	"睡懒觉","学习","报告","预约，预定","练习","联络，联系" };
	//char input[LONG] = { 0 };
	int j = 0;
	do
	{
		menu();
		printf("请选择:>");
		scanf("%d", &j);
		switch (j)
		{
		case 1:
			memory(V, answer);
			break;
		case 2:
			show(V, answer);
			break;
		case 0:
			printf("期待您的下次到来\n");
			break;
		default :
			printf("非法，再次输入\n");
			break;
		}
	} while (j);
	
	//printf("期待您的下次到来\n");
	return 0;
}